ejercicios/ejercicios_tema7.tex
% Created 2022-04-26 mar 19:06
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{color}
\usepackage{listings}
\usepackage[margin=2.5cm]{geometry}
\usepackage[spanish]{babel}
\usepackage[usenames,svgnames,dvipsnames]{xcolor}
\usepackage{listings}
\lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={¡}{{\textexclamdown}}1 {á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {í}{{\'i}}1 {ú}{{\'u}}1 {º}{{\textordmasculine}}1, showstringspaces=false}
\usepackage{mathpazo}
\hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}
\usepackage{fancyvrb}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\tiny, formatcom = {\color{black!70}}}
\date{}
\title{Ejercicios del Tema 7\\\medskip
\large Ficheros}
\hypersetup{
 pdfauthor={},
 pdftitle={Ejercicios del Tema 7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.6)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle

\section{Copia de ficheros}
\label{sec:org26b32f6}
Escribe	un programa que copie el contenido de un fichero en otro cambiando los espacios en blanco por un guión bajo \texttt{\_}. Emplea el fichero \texttt{lorem\_ipsum.txt} como ejemplo. (Sugerencia: revisa el ejercicio \guillemotleft{}Espacios por guiones\guillemotright{} del capítulo 4).

\section{Número de caracteres, palabras y líneas}
\label{sec:org5576622}

Escribe un programa que calcule el número de caracteres, palabras y líneas de un fichero de texto. Comprueba su funcionamiento con el fichero \texttt{lorem\_ipsum.txt}. 

\section{Cuenta letras}
\label{sec:org1d52c77}

Escribe un programa que analice el texto almacenado en un fichero representando el número de vocales que contiene mediante líneas de asteriscos. Este programa debe estar construido de manera similar al ejercicio planteado en el capítulo 4, empleando dos funciones, \texttt{cuentaLetra} y \texttt{pintaAsteriscos}. Puedes usar el fichero \texttt{lorem\_ipsum.txt} como ejemplo.

\begin{itemize}
\item Versión sin asignación dinámica de memoria (procesando carácter a carácter)
\item Versión con asignación dinámica de memoria
\end{itemize}
\section{Máximo, mínimo y promedio de variables}
\label{sec:orgc25bcae}

El fichero \texttt{aranjuez.csv} es un fichero que almacena valores numéricos en formato CSV (valores separados por comas). Contiene 4 columnas (variables) y 2898 filas (registros). Cada fila corresponde a un valor diario de una variable meteorológica registrada en la estación localizada en Aranjuez. Estas variables son: temperatura ambiente, humedad, velocidad del viento, radiación solar.

Escribe un programa que lea este fichero almacenando el contenido de cada columna en un vector. A continuación, el programa debe calcular el valor máximo, mínimo y promedio de cada vector empleando una función separada para cada cálculo (\emph{revisa el ejercicio \guillemotleft{}Máximo, mínimo y promedio de una colección de números\guillemotright{} del capítulo 4}). Finalmente, el programa mostrará el resultado en pantalla y escribirá estos cálculos en un fichero con un formato similar al siguiente:

\begin{center}
\begin{tabular}{llll}
Variable & Min & Max & Media\\
Temp & XX & XX & XX\\
Humedad & XX & XX & XX\\
Viento & XX & XX & XX\\
Rad & XX & XX & XX\\
\end{tabular}
\end{center}



\textbf{Ampliación}: escribe una versión de este programa que realice la misma tarea pero sin conocer a priori el número de filas del fichero.
\end{document}